import re

pattern = r'''(?iux)(?<![а-яё])(?:
(?:(?:у|[нз]а|(?:хитро|не)?вз?[ыьъ]|с[ьъ]|(?:и|ра)[зс]ъ?|(?:о[тб]|п[оа]д)[ьъ]?|(?:\S(?=[а-яё]))+?[оаеи-])-?)?(?:
  [её](?:б(?!о[рй]|рач)|п[уа](?:ц|тс))|
  и[пб][ае][тцд][ьъ]
).*?|

(?:(?:н[иеа]|(?:ра|и)[зс]|[зд]?[ао](?:т|дн[оа])?|с(?:м[еи])?|а[пб]ч|в[ъы]?|пр[еи])-?)?ху(?:[яйиеёю]|л+и(?!ган)).*?|

бл(?:[эя]|еа?)(?:[дт][ьъ]?)?|

\S*?(?:
  п(?:
    [иеё]зд|
    ид[аое]?р|
    ед(?:р(?!о)|[аое]р|ик)|
    охую
  )|
  бля(?:[дбц]|тс)|
  [ое]ху[яйиеё]|
  хуйн
).*?|

(?:о[тб]?|про|на|вы)?м(?:
  анд(?:[ауеыи](?:л(?:и[сзщ])?[ауеиы])?|ой|[ао]в.*?|юк(?:ов|[ауи])?|е[нт]ь|ища)|
  уд(?:[яаиое].+?|е?н(?:[ьюия]|ей))|
  [ао]л[ао]ф[ьъ](?:[яиюе]|[еёо]й)
)|

елд[ауые].*?|
ля[тд]ь|
(?:[нз]а|по)х
)(?![а-яё])'''


latin_to_cyrillic = {
    'A': 'А', 'a': 'а',
    'B': 'Б', 'b': 'б',
    'C': 'Ц', 'c': 'ц',
    'D': 'Д', 'd': 'д',
    'E': 'Е', 'e': 'е',
    'F': 'Ф', 'f': 'ф',
    'G': 'Г', 'g': 'г',
    'H': 'Н', 'h': 'н',
    'I': 'И', 'i': 'и',
    'J': 'Й', 'j': 'й',
    'K': 'К', 'k': 'к',
    'L': 'Л', 'l': 'л',
    'M': 'М', 'm': 'м',
    'N': 'Н', 'n': 'н',
    'O': 'О', 'o': 'о',
    'P': 'П', 'p': 'п',
    'Q': 'Кю', 'q': 'кю',
    'R': 'Р', 'r': 'р',
    'S': 'С', 's': 'с',
    'T': 'Т', 't': 'т',
    'U': 'У', 'u': 'у',
    'V': 'В', 'v': 'в',
    'W': 'Ве', 'w': 'ве',
    'X': 'Х', 'x': 'х',
    'Y': 'Ы', 'y': 'ы',
    'Z': 'З', 'z': 'з',
    'AE': 'АЕ', 'ae': 'ае',
    'CH': 'Ч', 'ch': 'ч',
    'SH': 'Ш', 'sh': 'ш',
    'ZH': 'Ж', 'zh': 'ж',
    'YU': 'Ю', 'yu': 'ю',
    'YA': 'Я', 'ya': 'я',
    'IO': 'ИО', 'io': 'ио',
    'IE': 'ИЕ', 'ie': 'ие',
    'YI': 'И', 'yi': 'и',
    'EH': 'ЭХ', 'eh': 'эх',
    'OE': 'ОЕ', 'oe': 'ое',
    'PS': 'ПС', 'ps': 'пс',
    'TS': 'ТС', 'ts': 'тс',
    'DZ': 'ДЗ', 'dz': 'дз',
    'GH': 'ГХ', 'gh': 'гх',
    'KH': 'ХХ', 'kh': 'хх',
    'SHCH': 'Щ', 'shch': 'щ',
    'YERU': 'Ё', 'yeru': 'ё',
    'YERI': 'Ё', 'yeri': 'ё',
    'YERY': 'Ё', 'yery': 'ё',
    'YERYA': 'ЁЯ', 'yerya': 'ёя',
    'YERYU': 'ЁЮ', 'yeryu': 'ёю',
    'YERIYA': 'ЁЯ', 'yeriya': 'ёя',
    'YERIYU': 'ЁЮ', 'yeriyu': 'ёю',
}

def replace_latin_with_cyrillic(text):
    return ''.join(latin_to_cyrillic.get(char, char) for char in text)

def filter_text(text):
    text = replace_latin_with_cyrillic(text)
    return re.sub(pattern, "**", text)
