def get_start_text():
    return (
        '<b>Привет!</b>\n\n'
        'Я бот для обнаружения спама. Просто пригласите меня в вашу группу, и я удалю все спам-сообщения.\n\n'
        'Иногда я могу ошибаться в определении спама, но я постоянно улучшаю свою работу и над этим работаю.\n\n'
        'Приятного использования!\n\n'
        '<i>Админ: @NeuroSpaceX</i>\n\n'
        'Для получения дополнительной информации используйте команду /help.'
    )

def get_help_text():
    return (
        "<b>Информация о боте</b>\n\n"
        "Я бот для обнаружения спама. Просто пригласите меня в вашу группу, и я удалю все спам-сообщения.\n\n"
        "<b>Команды:</b>\n"
        "/start - Запустить бота\n"
        "/info - Получить информацию о текущих настройках группы\n"
        "/setthreshold threshold - Установить порог сообщений для фильтрации спама.\n"
        "<b>Разработчики:</b>\n"
        "Бот и нейронная сеть разработаны: @NeuroSpaceX\n"
        "Все права защищены.\n\n"
        "Огромное спасибо @alexCoder23 за хостинг бота! ❤️\n\n"
        "<b>Поддержка:</b>\n"
        "totoshkus@gmail.com\n\n"
    )